//
//  String.swift
//  GoD
//
//  Created by kai chen on 2019/11/6.
//  Copyright © 2019 Chen. All rights reserved.
//

import SpriteKit
struct Strings {
    static let tips = [
        "精灵，或者树灵，植物孕育出的高级智慧生命，寿命极长",
        "智人，或者人类，第二代创世者的后代",
        "妖精，由原住生物进化而来的高智慧人形生物，有着各种各样的特征",
        "巨人，第一代创始者，已经是仅存于传说之中",
        "魔人，或者兽人，精灵智人妖精跨种族繁衍的后代，形态生命能力智慧均跟其父辈血统有关",
        "纯种的智人数量也不多，大陆西隅的小国，亚斯兰蒂斯是目前唯一的智人王国，但是其智人比例也不到一半",
        "纯种的妖精本身也不多，而且和一般魔人也无法从外表区分",
        "纯种和混血最大的区别在于对魔法的亲和力",
        "越接近人形，也就有越好的魔法亲和力，毕竟魔法是神带给世界的",
        "精灵，妖精都属于原住民，巨人和智人不是",
        "星之国是帕拉多滋最大也是最强大的国家",
        "星之国的国家宗旨是科技和贸易",
        "星之国是由魔人为主体组成的国家，统治阶级是法莱因议会，由7位德高望重能力超强的巫师组成",
        "议长狄诺洛斯，精灵，男，高阶法师",
        "议员阿洛狄斯，精灵，男，高阶法师",
    ]
}
